tutorials/multiphase/waves/porousWaveSolver/porousDamBreak/constant/porosityZones
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
For details on the porosity formulation and resistance coefficients please see:

@article{Jensen2014,
author = {Jensen, Bjarne and Jacobsen, Niels Gj\o{}l and Christensen, Erik Damgaard},
journal = {Coastal Engineering},
pages = {56--72},
publisher = {Elsevier B.V.},
title = {{Investigations on the porous media equations and resistance coefficients for coastal structures}},
volume = {84},
year = {2014},
}
*/

1
(
    porosity
    {
        // This is needed for early versions
        coordinateSystem
        {
            e1  (1 0 0);
            e2  (0 0 1);
        }

        // This is required for at least 2.3
        origin (0 0 0);
        coordinateRotation
        {
            type        axesRotation;
            e1  (1 0 0);
            e2  (0 0 1);
        }
        

        resistanceFormulation vanGent1995;

        porosity 0.49;
        KC KC [0 0 0 0 0 0 0] 128;
        gammaAddedMass 0.34;
        
        d50 d50 [0 1 0 0 0 0 0] 0.0159;
        alpha alpha [0 0 0 0 0 0 0] 500;
        beta beta [0 0 0 0 0 0 0] 2.0;
    }
)

// ************************************************************************* //
