tutorials/multiphase/waves/porousWaveSolver/porousDamBreak/constant/probeDefinitions
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevation
{
    type waveGauge;

    pointDistribution lineDistribution;
    N 90;
    linestart (0.00 0.00 0.00);
    lineend   (0.89 0.00 0.00);
    add       (0.00 0.50 0.00);
    axis      y;
    stretch   1.0;

    writeControl adjustableTime;
    writeInterval 0.01;
}


// ************************************************************************* //
