tutorials/multiphase/waves/porousWaveSolver/porousDamBreak/constant/waveProperties.input
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosityModel jensenJacobsenChristensen2014;

seaLevel            0;

relaxationNames     ( );

initializationName  ( );

// ************************************************************************* //
