tutorials/multiphase/waves/porousWaveSolver/porousDamBreak/system/setFieldsDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.281 0.24 1);
        
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }
boxToCell
    {
        box (0.281 0 -1) (0.892 0.022 1);
        
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }

);


// ************************************************************************* //
